app/Controllers/Home.php

    public function ajax(){
        $studentModel = new StudentModel();
        $uid = $this->session->get('uid');

        // Number of items per page
        $perPage = 5;

        // Get the current page number from the query string
        $page = $this->request->getVar('page') ?: 1;

        // Fetch the paginated results
        $students = $studentModel->where('uid', $uid)->paginate($perPage, 'group1', $page);
---
SELECT *
FROM `student`
WHERE `uid` = '3e79c75c4b9479e1fb03'
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `student`
WHERE `uid` = '3e79c75c4b9479e1fb03'