app/Controllers/StudentController.php

    public function ajax($method)
    {
        $Student = new StudentModel();
        if ($method == 'delete') {
            $id = $this->request->getVar('id');
            $Student->delete($id);
            return $this->response->setJSON(['status' => 'success','message'=>'Delete Successfully']);
        }

       if($method=='add'){
        $Student = new StudentModel();
        $json = $this->request->getJSON();
        $student_uuid = $this->session->get('uid');
        $data = [
            'student_id' => $json->student_id,
            'name' => $json->name,  // Corrected here
            'phone' => $json->phone,
            'age' => $json->age,
            'uid' => $student_uuid,
        ];

        $flag = $Student->insert($data, false);
---
INSERT INTO `student` (`student_id`, `name`, `phone`, `age`, `uid`) VALUES ('123', 'morsalin', '019231', '12', '3e79c75c4b9479e1fb03')

            ];


           $flag = $Student->set($data)->where('id', $id)->update();
---
UPDATE `student` SET `student_id` = '123', `name` = 'asd', `phone` = '56456456456', `age` = '321'
WHERE `id` = '13'